<?php
namespace nuke2015\api\org;

// 装载成功测试
class config_dajia
{
    public static function all()
    {
        $config                 = [];
        $config['block_action'] = [
            1 => '客服工具',
            2 => '预约',
            3 => '找月嫂',
            4 => '找育婴师',
        ];
        $config['banner_action'] = [
            1 => '客服工具',
            2 => '预约',
            3 => '找月嫂',
            4 => '找育婴师',
        ];
        $config['product_type_id'] = [
            1 => '月嫂长单',
            2 => '月嫂短单',
            3 => '保洁',
            4 => '护工',
            5 => '钟点工',
            6 => '产康',
            7 => '培训上课',
            8 => '考试拿证',
            9 => '育婴师长单平台费',
            10 => '育婴师短单平台费',
            11 => '育婴师月工资',
            12 => '保姆长单',
            13 => '保姆短单',
        ];
        // 付款状态[0未付款1定金2全款]
        $config['order_status_pay'] = [
            0 => '未付款',
            1 => '有定金',
            2 => '全款已付',
        ];

        // 服务状态[0待服务10服务中20已结束]
        $config['order_status_server'] = [
            0  => '待服务',
            10 => '服务中',
            20 => '已结束',
        ];
        $config['skiller_level'] = [
            3 => '三星级',
            4 => '四星级',
            5 => '五星级',
            6 => '六星级',
            7 => '金牌星级',
        ];
        $config['skiller_xueli'] = [
            1 => '小学',
            2 => '初中',
            3 => '高中',
            4 => '本科',
            5 => '硕士',
        ];
        $config['skiller_status'] = [
            -1 => '已下线',
            0  => '待审核',
            1  => '已上架',
        ];
        $config['skiller_cert_map'] = [
            1 => '身份证', 2 => '月嫂证', 3 => '健康证', 4 => '母婴护理证', 5 => '催乳师证', 6 => '营养师证', 7 => '护士证', 8 => '早教证', 9 => '健康管理师证', 10 => '幼师证', 11 => '育婴师证', 12 => '香港探亲证', 13 => '港澳通行证', 14 => '产后修复证', 15 => '小儿推拿证', 16 => '养老护理员',
        ];
        $config['schedule_status'] = [
            -1 => '已删除',
            0  => '空档',
            1  => '有订单',
            2  => '在培训',
            3  => '请假中',
            4  => '后台锁定',
        ];
        $config['order_pay_payment'] = [
            1  => '支付宝手机支付',
            2  => '支付宝手机网页支付',
            3  => '支付宝扫码支付',
            4  => '现金支付',
            5  => '微信支付',
            6  => '微信公众账号支付',
            7  => '微信公众账号扫码支付',
            8  => '支付宝 PC 网页支付',
            9  => '转账支付',
            10 => '线下刷卡',
            11 => '微信小程序',
            12 => '扫码支付',
            13 => '微信H5支付',
            14 => '招行',
            15 => '工资代扣',
        ];
        $config['order_plan_type'] = [
            1 => '服务费',
            2 => '节假日补贴',
            3 => '平台佣金',
            4 => '阿姨月工资',
            5 => '保险费用',
            6 => '补差价',
        ];
        return $config;
    }

    // 取单个
    public static function get($key){
        $all=self::all();
        return $all[$key];
    }
}
